#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# See http://www.catarc.org.cn/Upload/file/bzyj/PDF/zhengqiuyijian-sc3-14_1.pdf
chars = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K', 'L', 'M',
         'N', 'P', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

chars_indexes = {'1': 0, '2': 1, '3': 2, '4': 3, '5': 4, '6': 5, '7': 6, '8': 7, '9': 8, '0': 9, 'A': 10, 'B': 11, 'C':
    12, 'D': 13, 'E': 14, 'F': 15, 'G': 16, 'H': 17, 'J': 18, 'K': 19, 'L': 20, 'M': 21, 'N': 22, 'P': 23, 'R': 24, 'S':
    25, 'T': 26, 'U': 27, 'V': 28, 'W': 29, 'X': 30, 'Y': 31, 'Z': 32}


# 年份 第 10 位
YEARS_CODES = ['1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K', 'L', 'M',
               'N', 'P', 'R', 'S', 'T', 'V', 'W', 'X', 'Y']

YEARS_CODES_INDEX =  {'1': 0, '2': 1, '3': 2, '4': 3, '5': 4, '6': 5, '7': 6, '8': 7, '9': 8, 'A': 9, 'B': 10, 'C': 11,
                      'D': 12, 'E': 13, 'F': 14, 'G': 15, 'H': 16, 'J': 17, 'K': 18, 'L': 19, 'M': 20, 'N': 21, 'P': 22,
                      'R': 23, 'S': 24, 'T': 25, 'V': 26, 'W': 27, 'X': 28, 'Y': 29}


# 地区 第 1  位 1美国、J日本、S英国、2加拿大、K韩国、T瑞士、3墨西哥、L中国、V法国、4美国、R台湾、W德国、6澳大利亚、Y瑞典、9巴西、Z意大利
STATE_CODE = ['1', '4','J', 'K', 'L','W']
# STATE_INDEX = [0,3,18,19,24,25,20,25,26,28,29,32]
# 第4位表示车辆种类 　1、普通乘用车；2、活顶乘用车；3、高级乘用车；4、小型乘用车；5、敞篷车；6、掀背乘用车；7、旅行车；8、多用途乘用车；9、短头乘用车；
#  10、越野乘用车；11、专用乘用车(旅居车、防弹车、救护车、殡仪车)其中1-6一般称为轿车
FOUR_CODE = ['1', '2', '3', '4', '5', '6', '7', '8', '9']
# FOUR_INDEX = [0,1,2,3,4,5,6,7,8]
NINE_CODE = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
# NINE_INDEX =[9,0,1,2,3,4,5,6,7,8]
# 15-17 位


def generate_index(chars=chars):
    indexes = dict()
    for idx, char in enumerate(chars):
        indexes[char] = idx
    print(indexes)

if __name__ == '__main__':
    generate_index(YEARS_CODES)
